TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_unicommi2cc.h
/** @addtogroup UNICOMMI2CC
  @{
*/

typedef struct {
       uint32_t RESERVED0[1024];
  __IO uint32_t CLKDIV;                            /* !< (@ 0x00001000) Clock Divider */
       uint32_t RESERVED1;
  __IO uint32_t CLKSEL;                            /* !< (@ 0x00001008) Clock Select for Ultra Low Power peripherals */
       uint32_t RESERVED2[3];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00001018) Peripheral Debug Control */
       uint32_t RESERVED3;
  UNICOMMI2CC_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED4;
  UNICOMMI2CC_DMA_TRIG1_Regs  DMA_TRIG1;                         /* !< (@ 0x00001050) */
       uint32_t RESERVED5[3];
  UNICOMMI2CC_DMA_TRIG0_Regs  DMA_TRIG0;                         /* !< (@ 0x00001080) */
       uint32_t RESERVED6[3];
  UNICOMMI2CC_SPGDMA_Regs  SPGDMA;                            /* !< (@ 0x000010B0) */
       uint32_t RESERVED7[5];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000010E4) Interrupt control register */
       uint32_t RESERVED8[6];
  __IO uint32_t CTR;                               /* !< (@ 0x00001100) Control Register */
  __IO uint32_t CR;                                /* !< (@ 0x00001104) Configuration */
  __I  uint32_t SR;                                /* !< (@ 0x00001108) Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0000110C) Interrupt FIFO Level Select Register */
  __IO uint32_t TPR;                               /* !< (@ 0x00001110) Timer Period */
       uint32_t RESERVED9;
  __IO uint32_t GFCTL;                             /* !< (@ 0x00001118) I2C Glitch Filter Control */
  __I  uint32_t BMON;                              /* !< (@ 0x0000111C) Bus Monitor */
  __O  uint32_t TXDATA;                            /* !< (@ 0x00001120) TXData */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00001124) RXData */
  __I  uint32_t PECSR;                             /* !< (@ 0x00001128) PEC status register */
       uint32_t RESERVED10[8];
  __IO uint32_t TA;                                /* !< (@ 0x0000114C) Target Address Register */
  __I  uint32_t TIMEOUT_CNT;                       /* !< (@ 0x00001150) I2C Timeout Count Register */
  __IO uint32_t TIMEOUT_CTL;                       /* !< (@ 0x00001154) I2C Timeout Count Control Register */
  __IO uint32_t PECCTL;                            /* !< (@ 0x00001158) I2C PEC control register */
} UNICOMMI2CC_Regs;

/*@}*/ /* end of group UNICOMMI2CC */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* UNICOMMI2CC Register Control Bits
******************************************************************************/

/* UNICOMMI2CC_SPGDMARXCTL Bits */
/* UNICOMMI2CC_SPGDMARXCTL[DMAEN] Bits */
#define UNICOMMI2CC_SPGDMARXCTL_DMAEN_OFS        (1)                             /* !< DMAEN Offset */
#define UNICOMMI2CC_SPGDMARXCTL_DMAEN_MASK       ((uint32_t)0x00000002U)         /* !< DMA enable */
#define UNICOMMI2CC_SPGDMARXCTL_DMAEN_DISABLE    ((uint32_t)0x00000000U)         /* !< DMA channel disabled */
#define UNICOMMI2CC_SPGDMARXCTL_DMAEN_ENABLE     ((uint32_t)0x00000002U)         /* !< DMA channel enabled */
/* UNICOMMI2CC_SPGDMARXCTL[DMAMEMINCR] Bits */
#define UNICOMMI2CC_SPGDMARXCTL_DMAMEMINCR_OFS   (20)                            /* !< DMAMEMINCR Offset */
#define UNICOMMI2CC_SPGDMARXCTL_DMAMEMINCR_MASK  ((uint32_t)0x00100000U)         /* !< DMA destination increment. This bit
                                                                                    selects automatic incrementing or
                                                                                    decrementing of the destination
                                                                                    address DMADA for each transfer. The
                                                                                    amount of change to the DMADA is
                                                                                    based on the definition in the
                                                                                    DMADSTWDTH. For example, an increment
                                                                                    of 1 (+1) on a WORD transfer will
                                                                                    increment the DMADA by 4. */
#define UNICOMMI2CC_SPGDMARXCTL_DMAMEMINCR_INCREMENT ((uint32_t)0x00000000U)         /* !< Incremented by 1 (+1 * DMADSTWDTH) */
#define UNICOMMI2CC_SPGDMARXCTL_DMAMEMINCR_DECREMENT ((uint32_t)0x00100000U)         /* !< Decremented by 1 (-1 * DMADSTWDTH) */
/* UNICOMMI2CC_SPGDMARXCTL[DMAPREIRQ] Bits */
#define UNICOMMI2CC_SPGDMARXCTL_DMAPREIRQ_OFS    (24)                            /* !< DMAPREIRQ Offset */
#define UNICOMMI2CC_SPGDMARXCTL_DMAPREIRQ_MASK   ((uint32_t)0x01000000U)         /* !< Enable an early IRQ event. This can
                                                                                    help software to react quicker to and
                                                                                    DMA done event or allows some
                                                                                    additional configuration before the
                                                                                    channel is complete.   Note: This
                                                                                    register is only available in a
                                                                                    FULL-channel configuration. Please
                                                                                    consult the datasheet of the specific
                                                                                    device to map which channel number
                                                                                    has FULL or BASIC capability. In a
                                                                                    BASIC configuration this register is
                                                                                    a read only value and always reads as
                                                                                    0x0. */
#define UNICOMMI2CC_SPGDMARXCTL_DMAPREIRQ_PREIRQ_DISABLE ((uint32_t)0x00000000U)         /* !< Pre-IRQ event disabled. */
#define UNICOMMI2CC_SPGDMARXCTL_DMAPREIRQ_PREIRQ_HALF ((uint32_t)0x01000000U)         /* !< Issue Pre-IRQ event when DMASZ
                                                                                    reached the half size point of the
                                                                                    original transfer size */
/* UNICOMMI2CC_SPGDMARXCTL[DMATM] Bits */
#define UNICOMMI2CC_SPGDMARXCTL_DMATM_OFS        (27)                            /* !< DMATM Offset */
#define UNICOMMI2CC_SPGDMARXCTL_DMATM_MASK       ((uint32_t)0x08000000U)         /* !< DMA transfer mode register */
#define UNICOMMI2CC_SPGDMARXCTL_DMATM_SINGLE     ((uint32_t)0x00000000U)         /* !< Single transfer. Each transfer
                                                                                    requires a new trigger. When the
                                                                                    DMASZ counts down to zero an event
                                                                                    can be generated and the DMAEN is
                                                                                    cleared. */
#define UNICOMMI2CC_SPGDMARXCTL_DMATM_RPTSNGL    ((uint32_t)0x08000000U)         /* !< Repeated single transfer. Each
                                                                                    transfer requires a new trigger. When
                                                                                    the DMASZ counts down to zero an
                                                                                    event can be generated. After the
                                                                                    last transfer the DMASA, DMADA, DAMSZ
                                                                                    registers are restored to its initial
                                                                                    value and the DMAEN stays enabled. */
/* UNICOMMI2CC_SPGDMARXCTL[DMADSTWDTH] Bits */
#define UNICOMMI2CC_SPGDMARXCTL_DMADSTWDTH_OFS   (28)                            /* !< DMADSTWDTH Offset */
#define UNICOMMI2CC_SPGDMARXCTL_DMADSTWDTH_MASK  ((uint32_t)0x30000000U)         /* !< DMA destination width. This bit
                                                                                    selects the destination as a byte,
                                                                                    half word, word or long word. */
#define UNICOMMI2CC_SPGDMARXCTL_DMADSTWDTH_BYTE  ((uint32_t)0x00000000U)         /* !< Destination data width is BYTE
                                                                                    (8-bit) */
#define UNICOMMI2CC_SPGDMARXCTL_DMADSTWDTH_HALF  ((uint32_t)0x10000000U)         /* !< Destination data width is HALF-WORD
                                                                                    (16-bit) */
#define UNICOMMI2CC_SPGDMARXCTL_DMADSTWDTH_WORD  ((uint32_t)0x20000000U)         /* !< Destination data width is WORD
                                                                                    (32-bit) */

/* UNICOMMI2CC_SPGDMARXDA Bits */
/* UNICOMMI2CC_SPGDMARXDA[ADDR] Bits */
#define UNICOMMI2CC_SPGDMARXDA_ADDR_OFS          (0)                             /* !< ADDR Offset */
#define UNICOMMI2CC_SPGDMARXDA_ADDR_MASK         ((uint32_t)0xFFFFFFFFU)         /* !< DMA Channel Destination Address */
#define UNICOMMI2CC_SPGDMARXDA_ADDR_MINIMUM      ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMI2CC_SPGDMARXDA_ADDR_MAXIMUM      ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* UNICOMMI2CC_SPGDMARXSZ Bits */
/* UNICOMMI2CC_SPGDMARXSZ[SIZE] Bits */
#define UNICOMMI2CC_SPGDMARXSZ_SIZE_OFS          (0)                             /* !< SIZE Offset */
#define UNICOMMI2CC_SPGDMARXSZ_SIZE_MASK         ((uint32_t)0x0000FFFFU)         /* !< DMA Channel Size in number of
                                                                                    transfers */
#define UNICOMMI2CC_SPGDMARXSZ_SIZE_MINIMUM      ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMI2CC_SPGDMARXSZ_SIZE_MAXIMUM      ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* UNICOMMI2CC_SPGDMATXCTL Bits */
/* UNICOMMI2CC_SPGDMATXCTL[DMAEN] Bits */
#define UNICOMMI2CC_SPGDMATXCTL_DMAEN_OFS        (1)                             /* !< DMAEN Offset */
#define UNICOMMI2CC_SPGDMATXCTL_DMAEN_MASK       ((uint32_t)0x00000002U)         /* !< DMA enable */
#define UNICOMMI2CC_SPGDMATXCTL_DMAEN_DISABLE    ((uint32_t)0x00000000U)         /* !< DMA channel disabled */
#define UNICOMMI2CC_SPGDMATXCTL_DMAEN_ENABLE     ((uint32_t)0x00000002U)         /* !< DMA channel enabled */
/* UNICOMMI2CC_SPGDMATXCTL[DMAMEMINCR] Bits */
#define UNICOMMI2CC_SPGDMATXCTL_DMAMEMINCR_OFS   (20)                            /* !< DMAMEMINCR Offset */
#define UNICOMMI2CC_SPGDMATXCTL_DMAMEMINCR_MASK  ((uint32_t)0x00100000U)         /* !< DMA destination increment. This bit
                                                                                    selects automatic incrementing or
                                                                                    decrementing of the destination
                                                                                    address DMADA for each transfer. The
                                                                                    amount of change to the DMADA is
                                                                                    based on the definition in the
                                                                                    DMADSTWDTH. For example, an increment
                                                                                    of 1 (+1) on a WORD transfer will
                                                                                    increment the DMADA by 4. */
#define UNICOMMI2CC_SPGDMATXCTL_DMAMEMINCR_INCREMENT ((uint32_t)0x00000000U)         /* !< Incremented by 1 (+1 * DMASRCWDTH) */
#define UNICOMMI2CC_SPGDMATXCTL_DMAMEMINCR_DECREMENT ((uint32_t)0x00100000U)         /* !< Decremented by 1 (-1 * DMASRCWDTH) */
/* UNICOMMI2CC_SPGDMATXCTL[DMAPREIRQ] Bits */
#define UNICOMMI2CC_SPGDMATXCTL_DMAPREIRQ_OFS    (24)                            /* !< DMAPREIRQ Offset */
#define UNICOMMI2CC_SPGDMATXCTL_DMAPREIRQ_MASK   ((uint32_t)0x01000000U)         /* !< Enable an early IRQ event. This can
                                                                                    help software to react quicker to and
                                                                                    DMA done event or allows some
                                                                                    additional configuration before the
                                                                                    channel is complete.   Note: This
                                                                                    register is only available in a
                                                                                    FULL-channel configuration. Please
                                                                                    consult the datasheet of the specific
                                                                                    device to map which channel number
                                                                                    has FULL or BASIC capability. In a
                                                                                    BASIC configuration this register is
                                                                                    a read only value and always reads as
                                                                                    0x0. */
#define UNICOMMI2CC_SPGDMATXCTL_DMAPREIRQ_PREIRQ_DISABLE ((uint32_t)0x00000000U)         /* !< Pre-IRQ event disabled. */
#define UNICOMMI2CC_SPGDMATXCTL_DMAPREIRQ_PREIRQ_HALF ((uint32_t)0x01000000U)         /* !< Issue Pre-IRQ event when DMASZ
                                                                                    reached the half size point of the
                                                                                    original transfer size */
/* UNICOMMI2CC_SPGDMATXCTL[DMATM] Bits */
#define UNICOMMI2CC_SPGDMATXCTL_DMATM_OFS        (27)                            /* !< DMATM Offset */
#define UNICOMMI2CC_SPGDMATXCTL_DMATM_MASK       ((uint32_t)0x08000000U)         /* !< DMA transfer mode register  Note:
                                                                                    The repeat-single (2h) and
                                                                                    repeat-block (3h) transfer are only
                                                                                    available in a FULL-channel
                                                                                    configuration. Please consult the
                                                                                    datasheet of the specific device to
                                                                                    map which channel number has FULL or
                                                                                    BASIC capability. In a BASIC channel
                                                                                    configuration only the values for
                                                                                    single (0h) and block (1h) transfer
                                                                                    can be set. */
#define UNICOMMI2CC_SPGDMATXCTL_DMATM_SINGLE     ((uint32_t)0x00000000U)         /* !< Single transfer. Each transfer
                                                                                    requires a new trigger. When the
                                                                                    DMASZ counts down to zero an event
                                                                                    can be generated and the DMAEN is
                                                                                    cleared. */
#define UNICOMMI2CC_SPGDMATXCTL_DMATM_RPTSNGL    ((uint32_t)0x08000000U)         /* !< Repeated single transfer. Each
                                                                                    transfer requires a new trigger. When
                                                                                    the DMASZ counts down to zero an
                                                                                    event can be generated. After the
                                                                                    last transfer the DMASA, DMADA, DAMSZ
                                                                                    registers are restored to its initial
                                                                                    value and the DMAEN stays enabled. */
/* UNICOMMI2CC_SPGDMATXCTL[DMASRCWDTH] Bits */
#define UNICOMMI2CC_SPGDMATXCTL_DMASRCWDTH_OFS   (28)                            /* !< DMASRCWDTH Offset */
#define UNICOMMI2CC_SPGDMATXCTL_DMASRCWDTH_MASK  ((uint32_t)0x30000000U)         /* !< DMA source width. This bit selects
                                                                                    the source data width as a byte, half
                                                                                    word, word or long word. */
#define UNICOMMI2CC_SPGDMATXCTL_DMASRCWDTH_BYTE  ((uint32_t)0x00000000U)         /* !< Source data width is BYTE (8-bit) */
#define UNICOMMI2CC_SPGDMATXCTL_DMASRCWDTH_HALF  ((uint32_t)0x10000000U)         /* !< Source data width is HALF-WORD
                                                                                    (16-bit) */
#define UNICOMMI2CC_SPGDMATXCTL_DMASRCWDTH_WORD  ((uint32_t)0x20000000U)         /* !< Source data width is WORD (32-bit) */

/* UNICOMMI2CC_SPGDMATXSA Bits */
/* UNICOMMI2CC_SPGDMATXSA[ADDR] Bits */
#define UNICOMMI2CC_SPGDMATXSA_ADDR_OFS          (0)                             /* !< ADDR Offset */
#define UNICOMMI2CC_SPGDMATXSA_ADDR_MASK         ((uint32_t)0xFFFFFFFFU)         /* !< DMA Channel Destination Address */
#define UNICOMMI2CC_SPGDMATXSA_ADDR_MINIMUM      ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMI2CC_SPGDMATXSA_ADDR_MAXIMUM      ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* UNICOMMI2CC_SPGDMATXSZ Bits */
/* UNICOMMI2CC_SPGDMATXSZ[SIZE] Bits */
#define UNICOMMI2CC_SPGDMATXSZ_SIZE_OFS          (0)                             /* !< SIZE Offset */
#define UNICOMMI2CC_SPGDMATXSZ_SIZE_MASK         ((uint32_t)0x0000FFFFU)         /* !< DMA Channel Size in number of
                                                                                    transfers */
#define UNICOMMI2CC_SPGDMATXSZ_SIZE_MINIMUM      ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMI2CC_SPGDMATXSZ_SIZE_MAXIMUM      ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* UNICOMMI2CC_DMA_TRIG0_IMASK Bits */
/* UNICOMMI2CC_DMA_TRIG0_IMASK[TXTRG] Bits */
#define UNICOMMI2CC_DMA_TRIG0_IMASK_TXTRG_OFS    (3)                             /* !< TXTRG Offset */
#define UNICOMMI2CC_DMA_TRIG0_IMASK_TXTRG_MASK   ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define UNICOMMI2CC_DMA_TRIG0_IMASK_TXTRG_CLR    ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_DMA_TRIG0_IMASK_TXTRG_SET    ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CC_DMA_TRIG0_RIS Bits */
/* UNICOMMI2CC_DMA_TRIG0_RIS[TXTRG] Bits */
#define UNICOMMI2CC_DMA_TRIG0_RIS_TXTRG_OFS      (3)                             /* !< TXTRG Offset */
#define UNICOMMI2CC_DMA_TRIG0_RIS_TXTRG_MASK     ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define UNICOMMI2CC_DMA_TRIG0_RIS_TXTRG_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_DMA_TRIG0_RIS_TXTRG_SET      ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

/* UNICOMMI2CC_DMA_TRIG0_MIS Bits */
/* UNICOMMI2CC_DMA_TRIG0_MIS[TXTRG] Bits */
#define UNICOMMI2CC_DMA_TRIG0_MIS_TXTRG_OFS      (3)                             /* !< TXTRG Offset */
#define UNICOMMI2CC_DMA_TRIG0_MIS_TXTRG_MASK     ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define UNICOMMI2CC_DMA_TRIG0_MIS_TXTRG_CLR      ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_DMA_TRIG0_MIS_TXTRG_SET      ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */

