TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_unicommi2cc.h
/* UNICOMMI2CC_CPU_INT_ISET Bits */
/* UNICOMMI2CC_CPU_INT_ISET[RXDONE] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_RXDONE_OFS      (0)                             /* !< RXDONE Offset */
#define UNICOMMI2CC_CPU_INT_ISET_RXDONE_MASK     ((uint32_t)0x00000001U)         /* !< Receive Data Interrupt Signals that
                                                                                    a byte has been received */
#define UNICOMMI2CC_CPU_INT_ISET_RXDONE_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_CPU_INT_ISET_RXDONE_SET      ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_ISET[TIMEOUTA] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_TIMEOUTA_OFS    (12)                            /* !< TIMEOUTA Offset */
#define UNICOMMI2CC_CPU_INT_ISET_TIMEOUTA_MASK   ((uint32_t)0x00001000U)         /* !< Timeout A interrupt */
#define UNICOMMI2CC_CPU_INT_ISET_TIMEOUTA_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_CPU_INT_ISET_TIMEOUTA_SET    ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_ISET[NACK] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_NACK_OFS        (7)                             /* !< NACK Offset */
#define UNICOMMI2CC_CPU_INT_ISET_NACK_MASK       ((uint32_t)0x00000080U)         /* !< Address/Data NACK Interrupt */
#define UNICOMMI2CC_CPU_INT_ISET_NACK_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_CPU_INT_ISET_NACK_SET        ((uint32_t)0x00000080U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_ISET[START] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_START_OFS       (8)                             /* !< START Offset */
#define UNICOMMI2CC_CPU_INT_ISET_START_MASK      ((uint32_t)0x00000100U)         /* !< START Detection Interrupt */
#define UNICOMMI2CC_CPU_INT_ISET_START_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_CPU_INT_ISET_START_SET       ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_ISET[STOP] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_STOP_OFS        (9)                             /* !< STOP Offset */
#define UNICOMMI2CC_CPU_INT_ISET_STOP_MASK       ((uint32_t)0x00000200U)         /* !< STOP Detection Interrupt */
#define UNICOMMI2CC_CPU_INT_ISET_STOP_NO_EFFECT  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_CPU_INT_ISET_STOP_SET        ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_ISET[ARBLOST] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_ARBLOST_OFS     (10)                            /* !< ARBLOST Offset */
#define UNICOMMI2CC_CPU_INT_ISET_ARBLOST_MASK    ((uint32_t)0x00000400U)         /* !< Arbitration Lost Interrupt */
#define UNICOMMI2CC_CPU_INT_ISET_ARBLOST_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_CPU_INT_ISET_ARBLOST_SET     ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_ISET[TXDONE] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_TXDONE_OFS      (1)                             /* !< TXDONE Offset */
#define UNICOMMI2CC_CPU_INT_ISET_TXDONE_MASK     ((uint32_t)0x00000002U)         /* !< Transmit Transaction completed
                                                                                    Interrupt */
#define UNICOMMI2CC_CPU_INT_ISET_TXDONE_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_CPU_INT_ISET_TXDONE_SET      ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_ISET[RXTRG] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_RXTRG_OFS       (2)                             /* !< RXTRG Offset */
#define UNICOMMI2CC_CPU_INT_ISET_RXTRG_MASK      ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define UNICOMMI2CC_CPU_INT_ISET_RXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_CPU_INT_ISET_RXTRG_SET       ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_ISET[TXTRG] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_TXTRG_OFS       (3)                             /* !< TXTRG Offset */
#define UNICOMMI2CC_CPU_INT_ISET_TXTRG_MASK      ((uint32_t)0x00000008U)         /* !< Transmit Trigger */
#define UNICOMMI2CC_CPU_INT_ISET_TXTRG_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_CPU_INT_ISET_TXTRG_SET       ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_ISET[DMA_DONE_TX] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_DONE_TX_OFS (16)                            /* !< DMA_DONE_TX Offset */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_DONE_TX_MASK ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_DONE_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_DONE_TX_SET ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_ISET[DMA_DONE_RX] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_DONE_RX_OFS (15)                            /* !< DMA_DONE_RX Offset */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_DONE_RX_MASK ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_DONE_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_DONE_RX_SET ((uint32_t)0x00008000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_CPU_INT_ISET[PEC_RX_ERR] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_PEC_RX_ERR_OFS  (11)                            /* !< PEC_RX_ERR Offset */
#define UNICOMMI2CC_CPU_INT_ISET_PEC_RX_ERR_MASK ((uint32_t)0x00000800U)         /* !< RX Pec Error Interrupt */
#define UNICOMMI2CC_CPU_INT_ISET_PEC_RX_ERR_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_CPU_INT_ISET_PEC_RX_ERR_SET  ((uint32_t)0x00000800U)         /* !< Set interrupt */
/* UNICOMMI2CC_CPU_INT_ISET[TIMEOUTB] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_TIMEOUTB_OFS    (13)                            /* !< TIMEOUTB Offset */
#define UNICOMMI2CC_CPU_INT_ISET_TIMEOUTB_MASK   ((uint32_t)0x00002000U)         /* !< Timeout B Interrupt */
#define UNICOMMI2CC_CPU_INT_ISET_TIMEOUTB_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_CPU_INT_ISET_TIMEOUTB_SET    ((uint32_t)0x00002000U)         /* !< Set interrupt */
/* UNICOMMI2CC_CPU_INT_ISET[DMA_PREIRQ_RX] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_PREIRQ_RX_OFS (18)                            /* !< DMA_PREIRQ_RX Offset */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_PREIRQ_RX_MASK ((uint32_t)0x00040000U)         /* !< Set DMA PREIRQ Done on RX Event
                                                                                    Channel Interrupt */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_PREIRQ_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_PREIRQ_RX_SET ((uint32_t)0x00040000U)         /* !< Set Interrupt */
/* UNICOMMI2CC_CPU_INT_ISET[DMA_PREIRQ_TX] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_PREIRQ_TX_OFS (19)                            /* !< DMA_PREIRQ_TX Offset */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_PREIRQ_TX_MASK ((uint32_t)0x00080000U)         /* !< Set DMA PREIRQ Done on TX Event
                                                                                    Channel Interrupt */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_PREIRQ_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CC_CPU_INT_ISET_DMA_PREIRQ_TX_SET ((uint32_t)0x00080000U)         /* !< Set Interrupt */
/* UNICOMMI2CC_CPU_INT_ISET[RXFULL] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_RXFULL_OFS      (4)                             /* !< RXFULL Offset */
#define UNICOMMI2CC_CPU_INT_ISET_RXFULL_MASK     ((uint32_t)0x00000010U)         /* !< RXFIFO full event. */
#define UNICOMMI2CC_CPU_INT_ISET_RXFULL_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_CPU_INT_ISET_RXFULL_SET      ((uint32_t)0x00000010U)         /* !< Set Interrupt */
/* UNICOMMI2CC_CPU_INT_ISET[TXEMPTY] Bits */
#define UNICOMMI2CC_CPU_INT_ISET_TXEMPTY_OFS     (5)                             /* !< TXEMPTY Offset */
#define UNICOMMI2CC_CPU_INT_ISET_TXEMPTY_MASK    ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been shifted
                                                                                    out and the transmit goes into idle
                                                                                    mode. */
#define UNICOMMI2CC_CPU_INT_ISET_TXEMPTY_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_CPU_INT_ISET_TXEMPTY_SET     ((uint32_t)0x00000020U)         /* !< Set Interrupt */

/* UNICOMMI2CC_ICLR Bits */
/* UNICOMMI2CC_ICLR[RXDONE] Bits */
#define UNICOMMI2CC_ICLR_RXDONE_OFS              (0)                             /* !< RXDONE Offset */
#define UNICOMMI2CC_ICLR_RXDONE_MASK             ((uint32_t)0x00000001U)         /* !< Receive Data Interrupt Signals that
                                                                                    a byte has been received */
#define UNICOMMI2CC_ICLR_RXDONE_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_ICLR_RXDONE_CLR              ((uint32_t)0x00000001U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_ICLR[TIMEOUTA] Bits */
#define UNICOMMI2CC_ICLR_TIMEOUTA_OFS            (12)                            /* !< TIMEOUTA Offset */
#define UNICOMMI2CC_ICLR_TIMEOUTA_MASK           ((uint32_t)0x00001000U)         /* !< Timeout A interrupt */
#define UNICOMMI2CC_ICLR_TIMEOUTA_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_ICLR_TIMEOUTA_CLR            ((uint32_t)0x00001000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_ICLR[NACK] Bits */
#define UNICOMMI2CC_ICLR_NACK_OFS                (7)                             /* !< NACK Offset */
#define UNICOMMI2CC_ICLR_NACK_MASK               ((uint32_t)0x00000080U)         /* !< Address/Data NACK Interrupt */
#define UNICOMMI2CC_ICLR_NACK_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_ICLR_NACK_CLR                ((uint32_t)0x00000080U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_ICLR[START] Bits */
#define UNICOMMI2CC_ICLR_START_OFS               (8)                             /* !< START Offset */
#define UNICOMMI2CC_ICLR_START_MASK              ((uint32_t)0x00000100U)         /* !< START Detection Interrupt */
#define UNICOMMI2CC_ICLR_START_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_ICLR_START_CLR               ((uint32_t)0x00000100U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_ICLR[STOP] Bits */
#define UNICOMMI2CC_ICLR_STOP_OFS                (9)                             /* !< STOP Offset */
#define UNICOMMI2CC_ICLR_STOP_MASK               ((uint32_t)0x00000200U)         /* !< STOP Detection Interrupt */
#define UNICOMMI2CC_ICLR_STOP_NO_EFFECT          ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_ICLR_STOP_CLR                ((uint32_t)0x00000200U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_ICLR[ARBLOST] Bits */
#define UNICOMMI2CC_ICLR_ARBLOST_OFS             (10)                            /* !< ARBLOST Offset */
#define UNICOMMI2CC_ICLR_ARBLOST_MASK            ((uint32_t)0x00000400U)         /* !< Arbitration Lost Interrupt */
#define UNICOMMI2CC_ICLR_ARBLOST_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_ICLR_ARBLOST_CLR             ((uint32_t)0x00000400U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_ICLR[TXDONE] Bits */
#define UNICOMMI2CC_ICLR_TXDONE_OFS              (1)                             /* !< TXDONE Offset */
#define UNICOMMI2CC_ICLR_TXDONE_MASK             ((uint32_t)0x00000002U)         /* !< Transmit Transaction completed
                                                                                    Interrupt */
#define UNICOMMI2CC_ICLR_TXDONE_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_ICLR_TXDONE_CLR              ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_ICLR[RXTRG] Bits */
#define UNICOMMI2CC_ICLR_RXTRG_OFS               (2)                             /* !< RXTRG Offset */
#define UNICOMMI2CC_ICLR_RXTRG_MASK              ((uint32_t)0x00000004U)         /* !< Receive Trigger */
#define UNICOMMI2CC_ICLR_RXTRG_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_ICLR_RXTRG_CLR               ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_ICLR[TXTRG] Bits */
#define UNICOMMI2CC_ICLR_TXTRG_OFS               (3)                             /* !< TXTRG Offset */
#define UNICOMMI2CC_ICLR_TXTRG_MASK              ((uint32_t)0x00000008U)         /* !< Transmit FIFO Trigger */
#define UNICOMMI2CC_ICLR_TXTRG_NO_EFFECT         ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define UNICOMMI2CC_ICLR_TXTRG_CLR               ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_ICLR[DMA_DONE_TX] Bits */
#define UNICOMMI2CC_ICLR_DMA_DONE_TX_OFS         (16)                            /* !< DMA_DONE_TX Offset */
#define UNICOMMI2CC_ICLR_DMA_DONE_TX_MASK        ((uint32_t)0x00010000U)         /* !< DMA Done on Event Channel TX */
#define UNICOMMI2CC_ICLR_DMA_DONE_TX_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CC_ICLR_DMA_DONE_TX_CLR         ((uint32_t)0x00010000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_ICLR[DMA_DONE_RX] Bits */
#define UNICOMMI2CC_ICLR_DMA_DONE_RX_OFS         (15)                            /* !< DMA_DONE_RX Offset */
#define UNICOMMI2CC_ICLR_DMA_DONE_RX_MASK        ((uint32_t)0x00008000U)         /* !< DMA Done on Event Channel RX */
#define UNICOMMI2CC_ICLR_DMA_DONE_RX_NO_EFFECT   ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CC_ICLR_DMA_DONE_RX_CLR         ((uint32_t)0x00008000U)         /* !< Set Interrupt Mask */
/* UNICOMMI2CC_ICLR[PEC_RX_ERR] Bits */
#define UNICOMMI2CC_ICLR_PEC_RX_ERR_OFS          (11)                            /* !< PEC_RX_ERR Offset */
#define UNICOMMI2CC_ICLR_PEC_RX_ERR_MASK         ((uint32_t)0x00000800U)         /* !< RX Pec Error Interrupt */
#define UNICOMMI2CC_ICLR_PEC_RX_ERR_NO_EFFECT    ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_ICLR_PEC_RX_ERR_CLR          ((uint32_t)0x00000800U)         /* !< Clear Interrupt */
/* UNICOMMI2CC_ICLR[TIMEOUTB] Bits */
#define UNICOMMI2CC_ICLR_TIMEOUTB_OFS            (13)                            /* !< TIMEOUTB Offset */
#define UNICOMMI2CC_ICLR_TIMEOUTB_MASK           ((uint32_t)0x00002000U)         /* !< Timeout B Interrupt */
#define UNICOMMI2CC_ICLR_TIMEOUTB_NO_EFFECT      ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_ICLR_TIMEOUTB_CLR            ((uint32_t)0x00002000U)         /* !< Clear Interrupt */
/* UNICOMMI2CC_ICLR[DMA_PREIRQ_RX] Bits */
#define UNICOMMI2CC_ICLR_DMA_PREIRQ_RX_OFS       (18)                            /* !< DMA_PREIRQ_RX Offset */
#define UNICOMMI2CC_ICLR_DMA_PREIRQ_RX_MASK      ((uint32_t)0x00040000U)         /* !< Clear DMA PREIRQ Done on RX Event
                                                                                    Channel Interrupt */
#define UNICOMMI2CC_ICLR_DMA_PREIRQ_RX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CC_ICLR_DMA_PREIRQ_RX_CLR       ((uint32_t)0x00040000U)         /* !< Clear Interrupt */
/* UNICOMMI2CC_ICLR[DMA_PREIRQ_TX] Bits */
#define UNICOMMI2CC_ICLR_DMA_PREIRQ_TX_OFS       (19)                            /* !< DMA_PREIRQ_TX Offset */
#define UNICOMMI2CC_ICLR_DMA_PREIRQ_TX_MASK      ((uint32_t)0x00080000U)         /* !< Clear DMA PREIRQ Done on TX Event
                                                                                    Channel Interrupt */
#define UNICOMMI2CC_ICLR_DMA_PREIRQ_TX_NO_EFFECT ((uint32_t)0x00000000U)         /* !< Interrupt disabled */
#define UNICOMMI2CC_ICLR_DMA_PREIRQ_TX_CLR       ((uint32_t)0x00080000U)         /* !< Clear Interrupt */
/* UNICOMMI2CC_ICLR[RXFULL] Bits */
#define UNICOMMI2CC_ICLR_RXFULL_OFS              (4)                             /* !< RXFULL Offset */
#define UNICOMMI2CC_ICLR_RXFULL_MASK             ((uint32_t)0x00000010U)         /* !< RXFIFO full event. */
#define UNICOMMI2CC_ICLR_RXFULL_NO_EFFECT        ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_ICLR_RXFULL_CLR              ((uint32_t)0x00000010U)         /* !< Clear Interrupt */
/* UNICOMMI2CC_ICLR[TXEMPTY] Bits */
#define UNICOMMI2CC_ICLR_TXEMPTY_OFS             (5)                             /* !< TXEMPTY Offset */
#define UNICOMMI2CC_ICLR_TXEMPTY_MASK            ((uint32_t)0x00000020U)         /* !< Transmit FIFO Empty interrupt mask.
                                                                                    This interrupt is set if all data in
                                                                                    the Transmit FIFO have been shifted
                                                                                    out and the transmit goes into idle
                                                                                    mode. */
#define UNICOMMI2CC_ICLR_TXEMPTY_NO_EFFECT       ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define UNICOMMI2CC_ICLR_TXEMPTY_CLR             ((uint32_t)0x00000020U)         /* !< Clear Interrupt */

/* UNICOMMI2CC_CLKDIV Bits */
/* UNICOMMI2CC_CLKDIV[RATIO] Bits */
#define UNICOMMI2CC_CLKDIV_RATIO_OFS             (0)                             /* !< RATIO Offset */
#define UNICOMMI2CC_CLKDIV_RATIO_MASK            ((uint32_t)0x0000003FU)         /* !< Selects divide ratio of module
                                                                                    clock  Division factor  0 : DIV_BY_1
                                                                                    1 : DIV_BY_2 .... 63: DIV_BY_64 */
#define UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_1        ((uint32_t)0x00000000U)         /* !< Do not divide clock source */
#define UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_2        ((uint32_t)0x00000001U)         /* !< Divide clock source by 2 */
#define UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_3        ((uint32_t)0x00000002U)         /* !< Divide clock source by 3 */
#define UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_4        ((uint32_t)0x00000003U)         /* !< Divide clock source by 4 */
#define UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_5        ((uint32_t)0x00000004U)         /* !< Divide clock source by 5 */
#define UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_6        ((uint32_t)0x00000005U)         /* !< Divide clock source by 6 */
#define UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_7        ((uint32_t)0x00000006U)         /* !< Divide clock source by 7 */
#define UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_8        ((uint32_t)0x00000007U)         /* !< Divide clock source by 8 */
#define UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_61       ((uint32_t)0x0000003CU)         /* !< Divide clock source by 8 */
#define UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_62       ((uint32_t)0x0000003DU)         /* !< Divide clock source by 8 */
#define UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_63       ((uint32_t)0x0000003EU)         /* !< Divide clock source by 8 */
#define UNICOMMI2CC_CLKDIV_RATIO_DIV_BY_64       ((uint32_t)0x0000003FU)         /* !< Divide clock source by 8 */

