TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_unicommi2cc.h
/* UNICOMMI2CC_CLKSEL Bits */
/* UNICOMMI2CC_CLKSEL[MFCLK_SEL] Bits */
#define UNICOMMI2CC_CLKSEL_MFCLK_SEL_OFS         (2)                             /* !< MFCLK_SEL Offset */
#define UNICOMMI2CC_CLKSEL_MFCLK_SEL_MASK        ((uint32_t)0x00000004U)         /* !< Selects MFCLK as clock source if
                                                                                    enabled */
#define UNICOMMI2CC_CLKSEL_MFCLK_SEL_DISABLE     ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMI2CC_CLKSEL_MFCLK_SEL_ENABLE      ((uint32_t)0x00000004U)         /* !< Select this clock as a source */
/* UNICOMMI2CC_CLKSEL[BUSCLK_SEL] Bits */
#define UNICOMMI2CC_CLKSEL_BUSCLK_SEL_OFS        (3)                             /* !< BUSCLK_SEL Offset */
#define UNICOMMI2CC_CLKSEL_BUSCLK_SEL_MASK       ((uint32_t)0x00000008U)         /* !< Selects BUS CLK as clock source if
                                                                                    enabled */
#define UNICOMMI2CC_CLKSEL_BUSCLK_SEL_DISABLE    ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMI2CC_CLKSEL_BUSCLK_SEL_ENABLE     ((uint32_t)0x00000008U)         /* !< Select this clock as a source */
/* UNICOMMI2CC_CLKSEL[ASYNC_SYSCLK_SEL] Bits */
#define UNICOMMI2CC_CLKSEL_ASYNC_SYSCLK_SEL_OFS  (9)                             /* !< ASYNC_SYSCLK_SEL Offset */
#define UNICOMMI2CC_CLKSEL_ASYNC_SYSCLK_SEL_MASK ((uint32_t)0x00000200U)         /* !< Asynchronous sysclk selected as
                                                                                    source */
#define UNICOMMI2CC_CLKSEL_ASYNC_SYSCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMI2CC_CLKSEL_ASYNC_SYSCLK_SEL_ENABLE ((uint32_t)0x00000200U)         /* !< Select this clock as a source */
/* UNICOMMI2CC_CLKSEL[ASYNC_HFCLK_SEL] Bits */
#define UNICOMMI2CC_CLKSEL_ASYNC_HFCLK_SEL_OFS   (10)                            /* !< ASYNC_HFCLK_SEL Offset */
#define UNICOMMI2CC_CLKSEL_ASYNC_HFCLK_SEL_MASK  ((uint32_t)0x00000400U)         /* !< Asynchronous HFCLK selected as
                                                                                    source */
#define UNICOMMI2CC_CLKSEL_ASYNC_HFCLK_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMI2CC_CLKSEL_ASYNC_HFCLK_SEL_ENABLE ((uint32_t)0x00000400U)         /* !< Select this clock as a source */
/* UNICOMMI2CC_CLKSEL[ASYNC_PLL_SEL] Bits */
#define UNICOMMI2CC_CLKSEL_ASYNC_PLL_SEL_OFS     (11)                            /* !< ASYNC_PLL_SEL Offset */
#define UNICOMMI2CC_CLKSEL_ASYNC_PLL_SEL_MASK    ((uint32_t)0x00000800U)         /* !< Asynchronous PLL selected as source */
#define UNICOMMI2CC_CLKSEL_ASYNC_PLL_SEL_DISABLE ((uint32_t)0x00000000U)         /* !< Does not select this clock as a
                                                                                    source */
#define UNICOMMI2CC_CLKSEL_ASYNC_PLL_SEL_ENABLE  ((uint32_t)0x00000800U)         /* !< Select this clock as a source */

/* UNICOMMI2CC_PDBGCTL Bits */
/* UNICOMMI2CC_PDBGCTL[FREE] Bits */
#define UNICOMMI2CC_PDBGCTL_FREE_OFS             (0)                             /* !< FREE Offset */
#define UNICOMMI2CC_PDBGCTL_FREE_MASK            ((uint32_t)0x00000001U)         /* !< Free run control */
#define UNICOMMI2CC_PDBGCTL_FREE_STOP            ((uint32_t)0x00000000U)         /* !< The peripheral freezes
                                                                                    functionality while the Core Halted
                                                                                    input is asserted and resumes when it
                                                                                    is deasserted. */
#define UNICOMMI2CC_PDBGCTL_FREE_RUN             ((uint32_t)0x00000001U)         /* !< The peripheral ignores the state of
                                                                                    the Core Halted input */
/* UNICOMMI2CC_PDBGCTL[SOFT] Bits */
#define UNICOMMI2CC_PDBGCTL_SOFT_OFS             (1)                             /* !< SOFT Offset */
#define UNICOMMI2CC_PDBGCTL_SOFT_MASK            ((uint32_t)0x00000002U)         /* !< Soft halt boundary control. This
                                                                                    function is only available, if [FREE]
                                                                                    is set to 'STOP' */
#define UNICOMMI2CC_PDBGCTL_SOFT_DEPRECATED      ((uint32_t)0x00000000U)         /* !< Not supported */
#define UNICOMMI2CC_PDBGCTL_SOFT_DELAYED         ((uint32_t)0x00000002U)         /* !< The peripheral blocks the debug
                                                                                    freeze until it has reached a
                                                                                    boundary where it can resume without
                                                                                    corruption */

/* UNICOMMI2CC_INTCTL Bits */
/* UNICOMMI2CC_INTCTL[INTEVAL] Bits */
#define UNICOMMI2CC_INTCTL_INTEVAL_OFS           (0)                             /* !< INTEVAL Offset */
#define UNICOMMI2CC_INTCTL_INTEVAL_MASK          ((uint32_t)0x00000001U)         /* !< Writing a 1 to this field
                                                                                    re-evaluates the interrupt sources. */
#define UNICOMMI2CC_INTCTL_INTEVAL_DISABLE       ((uint32_t)0x00000000U)         /* !< The interrupt or event line is
                                                                                    disabled. */
#define UNICOMMI2CC_INTCTL_INTEVAL_EVAL          ((uint32_t)0x00000001U)         /* !< The interrupt or event line is in
                                                                                    software mode. Software must clear
                                                                                    the RIS. */

/* UNICOMMI2CC_CTR Bits */
/* UNICOMMI2CC_CTR[FRM_START] Bits */
#define UNICOMMI2CC_CTR_FRM_START_OFS            (0)                             /* !< FRM_START Offset */
#define UNICOMMI2CC_CTR_FRM_START_MASK           ((uint32_t)0x00000001U)         /* !< Start Transfer */
#define UNICOMMI2CC_CTR_FRM_START_DISABLE        ((uint32_t)0x00000000U)         /* !< In standard mode, this encoding
                                                                                    means the Controller is unable to
                                                                                    transmit or receive data. */
#define UNICOMMI2CC_CTR_FRM_START_ENABLE         ((uint32_t)0x00000001U)         /* !< The Controller is able to transmit
                                                                                    or receive data. See field decoding
                                                                                    in Table: MCTR Field decoding. */
/* UNICOMMI2CC_CTR[START] Bits */
#define UNICOMMI2CC_CTR_START_OFS                (1)                             /* !< START Offset */
#define UNICOMMI2CC_CTR_START_MASK               ((uint32_t)0x00000002U)         /* !< Generate START */
#define UNICOMMI2CC_CTR_START_DISABLE            ((uint32_t)0x00000000U)         /* !< The controller does not generate
                                                                                    the START condition. */
#define UNICOMMI2CC_CTR_START_ENABLE             ((uint32_t)0x00000002U)         /* !< The controller generates the START
                                                                                    or repeated START condition. See
                                                                                    field decoding in Table: MCTR Field
                                                                                    decoding. */
/* UNICOMMI2CC_CTR[STOP] Bits */
#define UNICOMMI2CC_CTR_STOP_OFS                 (2)                             /* !< STOP Offset */
#define UNICOMMI2CC_CTR_STOP_MASK                ((uint32_t)0x00000004U)         /* !< Generate STOP */
#define UNICOMMI2CC_CTR_STOP_DISABLE             ((uint32_t)0x00000000U)         /* !< The controller does not generate
                                                                                    the STOP condition. */
#define UNICOMMI2CC_CTR_STOP_ENABLE              ((uint32_t)0x00000004U)         /* !< The controller generates the STOP
                                                                                    condition. See field decoding in
                                                                                    Table: MCTR Field decoding. */
/* UNICOMMI2CC_CTR[ACK] Bits */
#define UNICOMMI2CC_CTR_ACK_OFS                  (3)                             /* !< ACK Offset */
#define UNICOMMI2CC_CTR_ACK_MASK                 ((uint32_t)0x00000008U)         /* !< Data Acknowledge Enable. Software
                                                                                    needs to configure this bit to send
                                                                                    the ACK or NACK. See field decoding
                                                                                    in Table: MCTR Field decoding. */
#define UNICOMMI2CC_CTR_ACK_DISABLE              ((uint32_t)0x00000000U)         /* !< The last received data byte of a
                                                                                    transaction is not acknowledged
                                                                                    automatically . */
#define UNICOMMI2CC_CTR_ACK_ENABLE               ((uint32_t)0x00000008U)         /* !< The last received data byte of a
                                                                                    transaction is acknowledged
                                                                                    automatically . */
/* UNICOMMI2CC_CTR[BLEN] Bits */
#define UNICOMMI2CC_CTR_BLEN_OFS                 (16)                            /* !< BLEN Offset */
#define UNICOMMI2CC_CTR_BLEN_MASK                ((uint32_t)0x0FFF0000U)         /* !< I2C transaction length This field
                                                                                    contains the programmed length of
                                                                                    bytes of the Transaction. */
#define UNICOMMI2CC_CTR_BLEN_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMI2CC_CTR_BLEN_MAXIMUM             ((uint32_t)0x0FFF0000U)         /* !< Highest possible value */
/* UNICOMMI2CC_CTR[ACKOEN] Bits */
#define UNICOMMI2CC_CTR_ACKOEN_OFS               (4)                             /* !< ACKOEN Offset */
#define UNICOMMI2CC_CTR_ACKOEN_MASK              ((uint32_t)0x00000010U)         /* !< ACK overrride Enable */
#define UNICOMMI2CC_CTR_ACKOEN_DISABLE           ((uint32_t)0x00000000U)         /* !< No special behavior */
#define UNICOMMI2CC_CTR_ACKOEN_ENABLE            ((uint32_t)0x00000010U)         /* !< When 1 and the Controller is
                                                                                    receiving data and the number of
                                                                                    bytes indicated in MBLEN have been
                                                                                    received, the state machine will
                                                                                    generate an rxdone interrupt and wait
                                                                                    at the start of the ACK for FW to
                                                                                    indicate if an ACK or NACK should be
                                                                                    sent. The ACK or NACK is selected by
                                                                                    writing the MCTR register and setting
                                                                                    ACK accordingly. The other fields in
                                                                                    this register can also be written at
                                                                                    this time to continue on with the
                                                                                    transaction. If a NACK is sent the
                                                                                    state machine will automatically send
                                                                                    a Stop. */
/* UNICOMMI2CC_CTR[RD_ON_TXEMPTY] Bits */
#define UNICOMMI2CC_CTR_RD_ON_TXEMPTY_OFS        (5)                             /* !< RD_ON_TXEMPTY Offset */
#define UNICOMMI2CC_CTR_RD_ON_TXEMPTY_MASK       ((uint32_t)0x00000020U)         /* !< Read on TX Empty */
#define UNICOMMI2CC_CTR_RD_ON_TXEMPTY_DISABLE    ((uint32_t)0x00000000U)         /* !< No special behavior */
#define UNICOMMI2CC_CTR_RD_ON_TXEMPTY_ENABLE     ((uint32_t)0x00000020U)         /* !< When 1 the Controller will transmit
                                                                                    all bytes from the TX FIFO before
                                                                                    continuing with the programmed Burst
                                                                                    Run Read. If the DIR is not set to
                                                                                    Read in the MSA then this bit is
                                                                                    ignored. The Start must be set in the
                                                                                    MCTR for proper I2C protocol. The
                                                                                    Controller will first send the Start
                                                                                    Condition, I2C Address with R/W bit
                                                                                    set to write, before sending the
                                                                                    bytes in the TX FIFO. When the TX
                                                                                    FIFO is empty, the I2C transaction
                                                                                    will continue as programmed in MTCR
                                                                                    and MSA without sending a Stop
                                                                                    Condition. This is intended to be
                                                                                    used to perform simple I2C command
                                                                                    based reads transition that will
                                                                                    complete after initiating them
                                                                                    without having to get an interrupt to
                                                                                    turn the bus around. */
/* UNICOMMI2CC_CTR[SUSPEND] Bits */
#define UNICOMMI2CC_CTR_SUSPEND_OFS              (6)                             /* !< SUSPEND Offset */
#define UNICOMMI2CC_CTR_SUSPEND_MASK             ((uint32_t)0x00000040U)         /* !< Suspend external communication */
#define UNICOMMI2CC_CTR_SUSPEND_DISABLE          ((uint32_t)0x00000000U)         /* !< Functional mode resumed */
#define UNICOMMI2CC_CTR_SUSPEND_ENABLE           ((uint32_t)0x00000040U)         /* !< External communication suspended */

/* UNICOMMI2CC_CR Bits */
/* UNICOMMI2CC_CR[MCTL] Bits */
#define UNICOMMI2CC_CR_MCTL_OFS                  (1)                             /* !< MCTL Offset */
#define UNICOMMI2CC_CR_MCTL_MASK                 ((uint32_t)0x00000002U)         /* !< MultiController mode. In
                                                                                    MultiController mode the SCL high
                                                                                    time counts once the SCL line has
                                                                                    been detected high. If this is not
                                                                                    enabled the high time counts as soon
                                                                                    as the SCL line has been set high by
                                                                                    the I2C controller. */
#define UNICOMMI2CC_CR_MCTL_DISABLE              ((uint32_t)0x00000000U)         /* !< Disable MultiController mode. */
#define UNICOMMI2CC_CR_MCTL_ENABLE               ((uint32_t)0x00000002U)         /* !< Enable MultiController mode. */
/* UNICOMMI2CC_CR[ENABLE] Bits */
#define UNICOMMI2CC_CR_ENABLE_OFS                (0)                             /* !< ENABLE Offset */
#define UNICOMMI2CC_CR_ENABLE_MASK               ((uint32_t)0x00000001U)         /* !< Enable module.  After this bit has
                                                                                    been set, it should not be set again
                                                                                    unless it has been cleared by writing
                                                                                    a 0 or by a reset, otherwise transfer
                                                                                    failures may occur. */
#define UNICOMMI2CC_CR_ENABLE_DISABLE            ((uint32_t)0x00000000U)         /* !< Disables operation. */
#define UNICOMMI2CC_CR_ENABLE_ENABLE             ((uint32_t)0x00000001U)         /* !< Enables operation. */
/* UNICOMMI2CC_CR[CLKSTRETCH] Bits */
#define UNICOMMI2CC_CR_CLKSTRETCH_OFS            (2)                             /* !< CLKSTRETCH Offset */
#define UNICOMMI2CC_CR_CLKSTRETCH_MASK           ((uint32_t)0x00000004U)         /* !< Clock Stretching. This bit controls
                                                                                    the support for clock stretching of
                                                                                    the I2C bus. */
#define UNICOMMI2CC_CR_CLKSTRETCH_DISABLE        ((uint32_t)0x00000000U)         /* !< Disables the clock stretching
                                                                                    detection. This can be disabled if no
                                                                                    Target on the bus does support clock
                                                                                    stretching, so that the maximum speed
                                                                                    on the bus can be reached. */
#define UNICOMMI2CC_CR_CLKSTRETCH_ENABLE         ((uint32_t)0x00000004U)         /* !< Enables the clock stretching
                                                                                    detection. Enabling the clock
                                                                                    stretching ensures compliance to the
                                                                                    I2C standard but could limit the
                                                                                    speed due the clock stretching. */

