TexasInstruments/mspm0-sdk/source/ti/devices/msp/peripherals/hw_unicommi2cc.h
/* UNICOMMI2CC_GFCTL Bits */
/* UNICOMMI2CC_GFCTL[DGFSEL] Bits */
#define UNICOMMI2CC_GFCTL_DGFSEL_OFS             (0)                             /* !< DGFSEL Offset */
#define UNICOMMI2CC_GFCTL_DGFSEL_MASK            ((uint32_t)0x00000007U)         /* !< Glitch Suppression Pulse Width
                                                                                    This field controls the pulse width
                                                                                    select for glitch suppression on the
                                                                                    SCL and SDA lines. The following
                                                                                    values are the glitch suppression
                                                                                    values in terms of functional clocks.
                                                                                    (Core Domain only) */
#define UNICOMMI2CC_GFCTL_DGFSEL_DISABLED        ((uint32_t)0x00000000U)         /* !< Bypass */
#define UNICOMMI2CC_GFCTL_DGFSEL_CLK_1           ((uint32_t)0x00000001U)         /* !< 1 clock */
#define UNICOMMI2CC_GFCTL_DGFSEL_CLK_2           ((uint32_t)0x00000002U)         /* !< 2 clocks */
#define UNICOMMI2CC_GFCTL_DGFSEL_CLK_3           ((uint32_t)0x00000003U)         /* !< 3 clocks */
#define UNICOMMI2CC_GFCTL_DGFSEL_CLK_4           ((uint32_t)0x00000004U)         /* !< 4 clocks */
#define UNICOMMI2CC_GFCTL_DGFSEL_CLK_8           ((uint32_t)0x00000005U)         /* !< 8 clocks */
#define UNICOMMI2CC_GFCTL_DGFSEL_CLK_16          ((uint32_t)0x00000006U)         /* !< 16 clocks */
#define UNICOMMI2CC_GFCTL_DGFSEL_CLK_31          ((uint32_t)0x00000007U)         /* !< 31 clocks */
/* UNICOMMI2CC_GFCTL[AGFEN] Bits */
#define UNICOMMI2CC_GFCTL_AGFEN_OFS              (8)                             /* !< AGFEN Offset */
#define UNICOMMI2CC_GFCTL_AGFEN_MASK             ((uint32_t)0x00000100U)         /* !< Analog Glitch Suppression Enable */
#define UNICOMMI2CC_GFCTL_AGFEN_DISABLE          ((uint32_t)0x00000000U)         /* !< Analog Glitch Filter disable */
#define UNICOMMI2CC_GFCTL_AGFEN_ENABLE           ((uint32_t)0x00000100U)         /* !< Analog Glitch Filter enable */

/* UNICOMMI2CC_BMON Bits */
/* UNICOMMI2CC_BMON[SCL] Bits */
#define UNICOMMI2CC_BMON_SCL_OFS                 (0)                             /* !< SCL Offset */
#define UNICOMMI2CC_BMON_SCL_MASK                ((uint32_t)0x00000001U)         /* !< I2C SCL Status */
#define UNICOMMI2CC_BMON_SCL_CLEARED             ((uint32_t)0x00000000U)         /* !< The I2CSCL signal is low. */
#define UNICOMMI2CC_BMON_SCL_SET                 ((uint32_t)0x00000001U)         /* !< The I2CSCL signal is high. Note:
                                                                                    During and right after reset, the SCL
                                                                                    pin is in GPIO input mode without the
                                                                                    internal pull enabled. For proper I2C
                                                                                    operation, the user should have the
                                                                                    external pull-up resistor in place
                                                                                    before starting any I2C operations. */
/* UNICOMMI2CC_BMON[SDA] Bits */
#define UNICOMMI2CC_BMON_SDA_OFS                 (1)                             /* !< SDA Offset */
#define UNICOMMI2CC_BMON_SDA_MASK                ((uint32_t)0x00000002U)         /* !< I2C SDA Status */
#define UNICOMMI2CC_BMON_SDA_CLEARED             ((uint32_t)0x00000000U)         /* !< The I2CSDA signal is low. */
#define UNICOMMI2CC_BMON_SDA_SET                 ((uint32_t)0x00000002U)         /* !< The I2CSDA signal is high. Note:
                                                                                    During and right after reset, the SDA
                                                                                    pin is in GPIO input mode without the
                                                                                    internal pull enabled. For proper I2C
                                                                                    operation, the user should have the
                                                                                    external pull-up resistor in place
                                                                                    before starting any I2C operations. */

/* UNICOMMI2CC_TXDATA Bits */
/* UNICOMMI2CC_TXDATA[DATA] Bits */
#define UNICOMMI2CC_TXDATA_DATA_OFS              (0)                             /* !< DATA Offset */
#define UNICOMMI2CC_TXDATA_DATA_MASK             ((uint32_t)0x000000FFU)         /* !< Transmit Data This byte contains
                                                                                    the data to be transferred during the
                                                                                    next transaction. */
#define UNICOMMI2CC_TXDATA_DATA_MINIMUM          ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMI2CC_TXDATA_DATA_MAXIMUM          ((uint32_t)0x000000FFU)         /* !< Highest possible value */

/* UNICOMMI2CC_RXDATA Bits */
/* UNICOMMI2CC_RXDATA[DATA] Bits */
#define UNICOMMI2CC_RXDATA_DATA_OFS              (0)                             /* !< DATA Offset */
#define UNICOMMI2CC_RXDATA_DATA_MASK             ((uint32_t)0x000000FFU)         /* !< Received Data.  This field contains
                                                                                    the last received data. */
#define UNICOMMI2CC_RXDATA_DATA_MINIMUM          ((uint32_t)0x00000000U)         /* !< Smallest value */
#define UNICOMMI2CC_RXDATA_DATA_MAXIMUM          ((uint32_t)0x000000FFU)         /* !< Highest possible value */

